article/19.capture-screen-with-ffmpeg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 ffmpeg 录屏</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">使用 ffmpeg 录屏</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4db6519">1. Windows</a>
<ul>
<li><a href="#orgb28bd45">1.1. 列出使用的设备信息</a></li>
<li><a href="#org07c7d33">1.2. 录取整个屏幕</a></li>
<li><a href="#orga542d12">1.3. 录取部分屏幕</a></li>
</ul>
</li>
<li><a href="#org6250e3f">2. macOS</a>
<ul>
<li><a href="#org220dd8a">2.1. 列出所有设备</a></li>
<li><a href="#orgf9320b3">2.2. 录制整个屏幕</a></li>
</ul>
</li>
<li><a href="#org124ddb5">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org4db6519" class="outline-2">
<h2 id="org4db6519"><span class="section-number-2">1</span> Windows</h2>
<div class="outline-text-2" id="text-1">
<p>
使用 Windows 自带的 GDI screengrabber 录屏非常方便。
</p>
</div>

<div id="outline-container-orgb28bd45" class="outline-3">
<h3 id="orgb28bd45"><span class="section-number-3">1.1</span> 列出使用的设备信息</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -list_devices true -f dshow -i dummy
</pre>
</div>

<p>
在我的 Windows 7 下面信息如下：
</p>

<div class="org-src-container">
<pre class="src src-text">ffmpeg version 3.4 Copyright (c) 2000-2017 the FFmpeg developers
  built with gcc 7.2.0 (GCC)
  configuration: --enable-gpl --enable-version3 --enable-sdl2 --enable-bzlib --enable-fontconfig --enable-gnutls --enable-iconv --enable-libass --enable-libbluray --enable-libfreetype --enable-libmp3lame --enable-libopenjpeg --enable-libopus --enable-libshine --enable-libsnappy --enable-libsoxr --enable-libtheora --enable-libtwolame --enable-libvpx --enable-libwavpack --enable-libwebp --enable-libx264 --enable-libx265 --enable-libxml2 --enable-libzimg --enable-lzma --enable-zlib --enable-gmp --enable-libvidstab --enable-libvorbis --enable-cuda --enable-cuvid --enable-d3d11va --enable-nvenc --enable-dxva2 --enable-avisynth --enable-libmfx
  libavutil      55. 78.100 / 55. 78.100
  libavcodec     57.107.100 / 57.107.100
  libavformat    57. 83.100 / 57. 83.100
  libavdevice    57. 10.100 / 57. 10.100
  libavfilter     6.107.100 /  6.107.100
  libswscale      4.  8.100 /  4.  8.100
  libswresample   2.  9.100 /  2.  9.100
  libpostproc    54.  7.100 / 54.  7.100
[dshow @ 0000000000567740] DirectShow video devices (some may be both video and audio devices)
[dshow @ 0000000000567740] Could not enumerate video devices (or none found).
[dshow @ 0000000000567740] DirectShow audio devices
[dshow @ 0000000000567740] Could not enumerate audio only devices (or none found).
dummy: Immediate exit requested
</pre>
</div>
</div>
</div>

<div id="outline-container-org07c7d33" class="outline-3">
<h3 id="org07c7d33"><span class="section-number-3">1.2</span> 录取整个屏幕</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -f gdigrab -framerate 30 -i desktop output.mkv
</pre>
</div>
</div>
</div>

<div id="outline-container-orga542d12" class="outline-3">
<h3 id="orga542d12"><span class="section-number-3">1.3</span> 录取部分屏幕</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -f gdigrab -framerate 30 -offset_x 10 -offset_y 20 -video_size 1280x720 -show_region 1 -i desktop output.mkv
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org6250e3f" class="outline-2">
<h2 id="org6250e3f"><span class="section-number-2">2</span> macOS</h2>
<div class="outline-text-2" id="text-2">
<p>
mac 下使用 avfoundation 设备可以快速地录屏
</p>
</div>

<div id="outline-container-org220dd8a" class="outline-3">
<h3 id="org220dd8a"><span class="section-number-3">2.1</span> 列出所有设备</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -f avfoundation -list_devices true -i <span style="color: #2aa198;">""</span>
</pre>
</div>

<p>
在我的 macbook 上的输出设备如下：
</p>

<div class="org-src-container">
<pre class="src src-text">ffmpeg version 4.0.2 Copyright (c) 2000-2018 the FFmpeg developers
  built with Apple LLVM version 9.1.0 (clang-902.0.39.2)
  configuration: --prefix=/usr/local/Cellar/ffmpeg/4.0.2 --enable-shared --enable-pthreads --enable-version3 --enable-hardcoded-tables --enable-avresample --cc=clang --host-cflags= --host-ldflags= --enable-gpl --enable-libmp3lame --enable-libx264 --enable-libxvid --enable-opencl --enable-videotoolbox --disable-lzma
  libavutil      56. 14.100 / 56. 14.100
  libavcodec     58. 18.100 / 58. 18.100
  libavformat    58. 12.100 / 58. 12.100
  libavdevice    58.  3.100 / 58.  3.100
  libavfilter     7. 16.100 /  7. 16.100
  libavresample   4.  0.  0 /  4.  0.  0
  libswscale      5.  1.100 /  5.  1.100
  libswresample   3.  1.100 /  3.  1.100
  libpostproc    55.  1.100 / 55.  1.100
[AVFoundation input device @ 0x7f84f7c004c0] AVFoundation video devices:
[AVFoundation input device @ 0x7f84f7c004c0] [0] FaceTime HD Camera
[AVFoundation input device @ 0x7f84f7c004c0] [1] Capture screen 0
[AVFoundation input device @ 0x7f84f7c004c0] AVFoundation audio devices:
[AVFoundation input device @ 0x7f84f7c004c0] [0] MI Portable Bluetooth Speaker
[AVFoundation input device @ 0x7f84f7c004c0] [1] Built-in Microphone
: Input/output error
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9320b3" class="outline-3">
<h3 id="orgf9320b3"><span class="section-number-3">2.2</span> 录制整个屏幕</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>&lt;screen device index&gt;</code> 和 <code>&lt;audio device index&gt;</code> 参考设备的编号
</p>

<div class="org-src-container">
<pre class="src src-sh">ffmpeg -f avfoundation -i <span style="color: #2aa198;">"&lt;screen device index&gt;:&lt;audio device index&gt;"</span> output.mkv
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org124ddb5" class="outline-2">
<h2 id="org124ddb5"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://trac.ffmpeg.org/wiki/Capture/Desktop">Capture Desktop</a></li>
<li><a href="https://www.ffmpeg.org/">ffmpeg homepage</a></li>
<li><a href="https://github.com/jeanhwea/emacs.d/blob/master/lisp/init-ffmpeg.el">init-ffmpeg.el</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-16 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:41</p>
</div>
</body>
</html>
